{
  "Name": "Aetnir",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Jotunn",
  "IsUniqueJob": true,
  "UsesTemplate": "Jotunn",
  "Chapter": 1,
  "Vitality": 10,
  "HPMultiplier": 8,
  "Speed": 3,
  "Dash": 2,
  "Defense": 6,
  "Armor": 4,
  "FrayDamage": 4,
  "DamageDie": "d6",
  "Traits": [
    {
      "Name": "Enormous",
      "Description": "Size 3."
    },
    {
      "Name": "Fortify",
      "Description": "At the end of their turn, gains vigilance 1. Vigilance charges stack if a character gains more than one. A character can spend a charge of Vigilance for one of the following:\n- When an adjacent ally is targeted as part of an ability, shift all damage and effects to you instead of that ally, regardless of range.\n- Deal piercing fray damage to any foe that breaks adjacency with you for any reason during their turn.\nLose all vigilance charges at the start of your turn."
    },
    {
      "Name": "Titanfall",
      "Description": "When defeated, roll 1d6 and assign a compass direction (1-none, 2-N, 3-E, 4-S, 5-W, 6-GM choice). The Jotunn falls into a close blast 1 area to its space. Size 1 characters inside must save or take 2[D] damage, or [D] on a successful save. Move all characters out of the area into the closest available space and place the defeated Jotunn there. They count as a 2x2 space of height 1 terrain while defeated."
    },
    {
      "Name": "Heavy",
      "Description": "Immune to shove."
    }
  ],
  "Actions": [
    {
      "Name": "Titan Cut",
      "ActionCost": 1,
      "Tags": [ "melee attack", "line 4" ],
      "Hit": "[D]+[fray].",
      "Miss": "[fray].",
      "AreaEffect": "[fray]."
    },
    {
      "Name": "Great Leap",
      "ActionCost": 1,
      "Description": "The Aetnir flies 3, then shoves an adjacent character 2 spaces.",
      "Collide": "[D] and character is dazed."
    },
    {
      "Name": "Crush Cowards",
      "ActionCost": 1,
      "Tags": [ "special recharge", "end turn" ],
      "Effect": "The Aetnir raises its weapon and ends its turn. It must take a slow turn next round, but at the start of that turn, as a free action it sweeps its weapons, affecting a blast 3 area effect around it, with different effects depending on how close characters are. Foes 3 spaces away take 2[D]+fray. Foes 2 spaces away take [D]+fray. Adjacent foes take fray damage.",
      "Special": "This move only recharges if Break the Mighty is taken."
    },
    {
      "Name": "Break the Mighty",
      "ActionCost": 1,
      "Tags": [ "special recharge", "end turn" ],
      "Effect": "The Aetnir raises its shield and ends its turn. It must take a slow turn next round, but at the start of that turn, as a free action, it slams its shield down. Adjacent characters take 2[D] and are shoved 2 spaces away. Collide: Characters take [D] and are stunned.",
      "Special": "This move only recharges if Crush Cowards is taken."
    }
  ]
}