{
  "Name": "Lowlander",
  "Group": "Lowlander",
  "Type": "Faction",
  "FactionBlight": "Poisoned",
  "Traits": [
    {
      "Name": "Terrain Expert",
      "Description": "Ignores terrain disadvantage, difficult, and dangerous terrain."
    },
    {
      "Name": "Lowlander Toxin",
      "Description": "All attacks by lowlanders gain on hit: inflict lowlander toxin. A character afflicted by lowlander toxin loses 1 hp at the start of their turn, ignoring resistance, armor, and vigor. This effect cannot be cleansed and only ends when combat ends, or a character is defeated. Does not stack."
    }
  ],
  "SetupTraits": [
    {
      "Name": "Kin",
      "Description": "Lowlanders are kin, can be bargained with, and will flee or surrender if heavily outnumbered or heavily losing a fight.\n• Motivations: Lowlanders nearly always fight for territory or supplies. Negotiating for them for passage through their territory usually involves doing a favor or payment, and they typically respect fair deals. They prefer to take captives in battle and ransom them back later. They are survivors and won't hesitate to back down from a fight they know they will lose - conversely, they won’t hesitate to exploit weaknesses."
    },
    {
      "Name": "Suddenly!",
      "Description": "Once a round, at the start of any Lowlander turn, the GM can spring a lowlander trap in any unoccupied space not in range 2 of a player character. The trap is a size 1 intangible summon. Choose one of the following traps:\n• Snare trap - A character in range 3 of the trap must save or be shoved towards the trap until adjacent and have their speed reduced to 0 until the trap is disarmed.\n• Stake trap - Trap creates difficult and dangerous terrain in adjacent spaces.\n• Poison trap - Trap creates dangerous terrain in adjacent spaces. Characters that end their turn in the area are poisoned and inflicted with lowlander toxin.\nAll traps can be disarmed by a character taking the interact action adjacent. The trap remains on the field, but its effects are no longer active.\nLowlanders are not affected by their own traps, or their effects. Traps remain even if deactivated.\nLowlanders often come with tame monsters. You can use the Ruin Beast template to represent this. Tamed monsters are immune to lowlander traps, and will flee if lowlanders flee."
    }
  ]
}