{
  "Name": "Arkitek",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Relict",
  "IsUniqueJob": true,
  "Chapter": 2,
  "RestrictToTemplate": "Relict",
  "Vitality": 10,
  "HPMultiplier": 8,
  "Speed": 4,
  "Dash": 2,
  "Defense": 8,
  "Armor": 1,
  "FrayDamage": 4,
  "DamageDie": "d6",
  "Traits": [
    {
      "Name": "Shelter",
      "Description": "+1 boon on saves."
    },
    {
      "Name": "Life Link",
      "Description": "All foes with this trait on the battlefield share the same health pool."
    },
    {
      "Name": "Stoneskin",
      "Description": "While adjacent to a piece of created terrain, has resistance."
    }
  ],
  "Actions": [
    {
      "Name": "Diaga",
      "ActionCost": 1,
      "Description": "An ally in range 4 can save, ending a mark, status, or blight on a successful save. If that ally is bloodied, they also gain vigor 1."
    },
    {
      "Name": "Deep Call",
      "ActionCost": 1,
      "Tags": [ "ranged attack 6" ],
      "Hit": "[D]+[fray].",
      "Miss": "[fray].",
      "Effect": "1/round, the Arkitek may summon a height 1 terrain piece under its target, pushing it up, and the target must save or become branded."
    },
    {
      "Name": "Reconfigure",
      "ActionCost": 1,
      "Description": "The Arkitek teleports any number of created terrain pieces in range 4 to any other free space in range 4. Characters standing on the terrain or trapped inside are also moved with them."
    },
    {
      "Name": "Pillar of Iz",
      "ActionCost": 1,
      "Tags": [ "recharge 5+" ],
      "Description": "The Arkitek summons a height 1 terrain piece in range 5, a pylon, with 10 hp. Characters on the terrain when it's created are pushed up on top of it. The Pylon has aura 1. Inside the aura, relict characters have resistance to all damage."
    },
    {
      "Name": "Entombment of Iz",
      "ActionCost": 1,
      "Tags": [ "recharge 6" ],
      "Description": "The Arkitek entombs a character in a magical sarcophagus. While inside, they are winded+, have their speed reduced to 0 and are blinded. The Sarcophagus is a height 1 terrain piece with 10 hp that is destructible. Attacks automatically hit and it is destroyed when it reaches 0. It has resistance to damage from the character inside it."
    }
  ]
}