{
  "Name": "Wyrm",
  "Inherits": "Monstrosity",
  "Type": "Job",
  "Health": [ 4, 5, 6 ],
  "HPMultiplier": 3,
  "Speed": 4,
  "Run": 2,
  "Dash": 4,
  "Defense": 7,
  "Armor": [ 2, 3, 4 ],
  "Attack": [ 2, 4, 6 ],
  "FrayDamage": [ 2, 3, 4 ],
  "DamageType": "Magic",
  "SetupTraits": [
    {
      "Name": "Blightheart",
      "Description": "Wyrms deal one of the four blights exclusively, except for in their God of Destruction phase. Pick one when creating the Wyrm."
    }
  ],
  "Traits": [
    {
      "Name": "Enormous",
      "Description": "Size 3."
    },
    {
      "Name": "Monstrosity",
      "Description": "Takes 1 turn after every player character turn. If slow, only one of its turns is affected."
    },
    {
      "Name": "Colossus",
      "Description": "Has phasing for characters and terrain smaller than it and can end turn in those spaces. Ignores engagement from smaller characters. Ignores movement penalties for terrain."
    },
    {
      "Name": "Monstrous Strength",
      "Description": "All attacks have shove 1. 1/round after attacking a character, create a space of height 1 terrain adjacent to the target."
    },
    {
      "Name": "Wyrmscale",
      "Description": "Immune to pierce when not bloodied."
    },
    {
      "Name": "Rage of Arenheir",
      "Tags": [ "Overdrive 6" ],
      "Description": "Deals boosted damage if the current round is 6 or higher."
    }
  ],
  "Actions": [
    {
      "Name": "Juggernaut",
      "Tags": [ "1/round" ],
      "Description": "At the start of its turn, can save against all statuses and marks and clear all blights as a free action."
    }
  ],
  "BodyParts": [
    {
      "Name": "Wings",
      "HP": 15,
      "Description": "Cannot fly (all flying turns into dashes)"
    },
    {
      "Name": "Heartscale",
      "HP": 10,
      "Description": "Loses all armor."
    },
    {
      "Name": "Horns",
      "HP": 15,
      "Description": "Wyrm gains permanent hatred of the player that destroyed the horns."
    },
    {
      "Name": "Tail",
      "HP": 15,
      "Description": "Tail lash costs 2 actions. Characters can sell a Wyrm tail for 4 dust."
    }
  ],
  "PhasesDescription": "Enters a new phase at the start of every round, in order (looping back to phase I after phase III). Since the Wyrm enters God of Destruction the round its Overdrive triggers, characters should aim to end the fight by then.",
  "Phases": [
    {
      "Name": "Dominant",
      "Traits": [
        {
          "Name": "Cataclysm",
          "Description": "At the start of each of its turns, create a rock spire, a height 1 terrain piece in range 3 of a player character."
        }
      ],
      "Actions": [
        {
          "Name": "Snap",
          "ActionCost": 1,
          "Description": "Up to 3 characters in range 2 take piercing fray damage."
        },
        {
          "Name": "Swat",
          "ActionCost": 1,
          "Description": "Adjacent foe must save or be shoved 3 and staggered.",
          "Collide": "Also Stunned."
        },
        {
          "Name": "Eruption",
          "ActionCost": 1,
          "Tags": [ "recharge 5+" ],
          "Description": "A Rock spire in range 5 emits a pool of blight, covering every adjacent space to the spire. The space is dangerous and difficult terrain, and characters that end their turn in the space are blighted."
        },
        {
          "Name": "Tail Lash",
          "ActionCost": 1,
          "Tags": [ "melee attack", "arc 4" ],
          "Hit": "Deal heavy damage.",
          "Miss": "Deal light damage.",
          "AreaEffect": "Deal light damage and Shove 1. Must target a character in its area. Destroys any rock spires in the area."
        }
      ]
    },
    {
      "Name": "Soaring",
      "Traits": [
        {
          "Name": "Take to Wing",
          "Description": "Flying in this phase."
        }
      ],
      "Actions": [
        {
          "Name": "Rake",
          "ActionCost": 1,
          "Tags": [ "repeatable 2" ],
          "Description": "Fly in a line 3 area effect. Characters along the path take fray damage."
        },
        {
          "Name": "Spitfire",
          "ActionCost": 1,
          "Description": "Mark a character in range 6. At the end of that character’s turn, if that character is still marked, the Wyrm shoots a blast of blight at them for a blast 1 explosion area effect. Characters within must save or take light damage and be blighted. The ball destroys any rock spires in the area."
        },
        {
          "Name": "Scorch",
          "ActionCost": 2,
          "Tags": [ "ranged attack 8", "blast 1" ],
          "Hit": "Deal light damage.",
          "Miss": "Deal light damage.",
          "AreaEffect": "Deal light damage.",
          "Blightboost": "Increase all damage to heavy."
        },
        {
          "Name": "Tail Lash",
          "ActionCost": 1,
          "Tags": [ "melee attack", "arc 4" ],
          "Hit": "Deal heavy damage.",
          "Miss": "Deal light damage.",
          "AreaEffect": "Deal light damage and Shove 1. Must target a character in its area. Destroys any rock spires in the area."
        }
      ]
    },
    {
      "Name": "God of Destruction",
      "Description": "The Wyrm loses flying in this phase.",
      "Traits": [
        {
          "Name": "Pulse of Destruction",
          "Description": "The Wyrm’s max speed is 0 this phase. Every turn but the last turn this phase, the Wyrm must take the radiance and spitfire actions. The Wyrm is unstoppable and has resistance to all damage in this phase. The Wyrm’s last turn is slow, and it always takes Elden Chaos and Aftermath in order."
        }
      ],
      "Actions": [
        {
          "Name": "Radiance",
          "ActionCost": 1,
          "Description": "All characters not in cover from the Wyrm take light piercing damage as an area effect."
        },
        {
          "Name": "Spitfire",
          "ActionCost": 1,
          "Description": "Mark a character in range 6. At the end of that character’s turn, if that character is marked, the Wyrm shoots a blast of blight at them for a blast 1 explosion area effect. Characters within must save or take light damage and be blighted. The ball destroys any rock spires in the area."
        },
        {
          "Name": "Elden Chaos",
          "ActionCost": 1,
          "Tags": [ "ranged attack" ],
          "Description": "The Wyrm breathes a beam of pure ancient chaos. The beam is a 3 wide line area effect that crosses through all obstacles, terrain, and goes across the whole battlefield. Still count cover.",
          "Hit": "Deal heavy magic damage three times and inflict all blights.",
          "Miss": "Deal light damage twice and inflict all blights.",
          "AreaEffect": "Deal light damage twice and inflict all blights."
        },
        {
          "Name": "Aftermath",
          "ActionCost": 1,
          "Description": "All characters except the wyrm are dazed and winded. Destroy all rock spires and clear all eruptions."
        }
      ]
    }
  ]
}