{
  "Name": "Gigantapede",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Ruin Beast",
  "IsUniqueJob": true,
  "UsesTemplate": "Ruin Beast",
  "Chapter": 2,
  "Vitality": 10,
  "HPMultiplier": 8,
  "Speed": 3,
  "Dash": 2,
  "Defense": 6,
  "Armor": 4,
  "FrayDamage": 3,
  "DamageDie": "d6",
  "RemoveTraits": [ "Feral" ],
  "Traits": [
    {
      "Name": "Fortify",
      "Description": "At the end of their turn, gains vigilance 1. Vigilance charges stack if a character gains more than one. A character can spend a charge of Vigilance for one of the following:\n- When an adjacent ally is targeted as part of an ability, shift all damage and effects to you instead of that ally, regardless of range.\n- Deal piercing fray damage to any foe that breaks adjacency with you for any reason during their turn.\nLose all vigilance charges at the start of your turn."
    },
    {
      "Name": "Defiance",
      "Description": "Prevents hit points from being reduced past 1 hp. When this triggers, remove this effect and character becomes immune to all damage for the rest of the current turn."
    },
    {
      "Name": "Sturdy",
      "Description": "Immune to shove, daze, and stun."
    },
    {
      "Name": "Chitinous Coil",
      "Description": "The Gigantapede occupies an arc 6 space instead of a normal space for its size. Only its first and last space are attackable or can be used to make attacks or abilities, but its entire body causes obstruction and engagement. Keep track of which is the head, and which is the tail. Only one space can be hit if both are included in the area of an attack or ability (attacker chooses which). When it moves, move its head, then rearrange its body in any valid configuration."
    },
    {
      "Name": "Iron Scales",
      "Description": "Effect: When either the head or the tail of the Gigantapede takes damage from an attack or ability, that body part gains resistance to all damage until the other body part takes damage from an attack or ability. This effect swaps between head and tail indefinitely."
    }
  ],
  "Actions": [
    {
      "Name": "Thrash",
      "ActionCost": 1,
      "Tags": [ "melee attack", "multiattack" ],
      "Hit": "[D]+[fray].",
      "Miss": "[fray].",
      "Effect": "Foe must save or be stunned. Can be made from the head or tail."
    },
    {
      "Name": "Acid Spray",
      "ActionCost": 1,
      "Recharge": 6,
      "Tags": [ "line 4" ],
      "AreaEffect": "Characters inside must save or take [D] piercing damage 3 times, or once on a successful save.",
      "Effect": "Can only be made from the head."
    },
    {
      "Name": "Stinger",
      "ActionCost": 1,
      "Tags": [ "mark" ],
      "Description": "A character adjacent to the Gigantapede's tail must save or take [D] and be marked. While marked, they are poisoned, burning, vulnerable, and shoved 3 in a direction of the Gigantapede's choice at the start of their turn."
    },
    {
      "Name": "Burrow",
      "ActionCost": 2,
      "Description": "All characters adjacent to the Gigantapede are shoved 1. It's head then resurfaces in a new space in range 8, teleporting. Place its body in any configuration."
    }
  ]
}