{
  "Name": "Great Boulder Hob",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Hob",
  "IsUniqueJob": true,
  "UsesTemplate": "Hob",
  "Chapter": 1,
  "Vitality": 10,
  "HPMultiplier": 8,
  "Speed": 2,
  "Dash": 2,
  "Defense": 4,
  "Armor": 12,
  "FrayDamage": 4,
  "DamageDie": "d10",
  "Traits": [
    {
      "Name": "Enormous",
      "Description": "Size 3."
    },
    {
      "Name": "Greenwalker",
      "Description": "All hobs ignore difficult and dangerous terrain."
    },
    {
      "Name": "Body of the Land",
      "Description": "When defeated, roll a d6. The Hob collapses into the natural land, disappearing. Every space of this Hob becomes a height 1 terrain piece (5-6), difficult terrain (2-4), or a pit (1)."
    },
    {
      "Name": "Fortify",
      "Description": "At the end of their turn, gains vigilance 1. Vigilance charges stack if a character gains more than one. A character can spend a charge of Vigilance for one of the following:\n- When an adjacent ally is targeted as part of an ability, shift all damage and effects to you instead of that ally, regardless of range.\n- Deal piercing fray damage to any foe that breaks adjacency with you for any reason during their turn.\nLose all vigilance charges at the start of your turn."
    },
    {
      "Name": "Sturdy",
      "Description": "Immune to shove, daze, and stun."
    },
    {
      "Name": "Lumbering",
      "Description": "Permanently slow and winded."
    },
    {
      "Name": "Crumbling Body",
      "Description": "Has 12 armor. Each time it takes damage from an action or ability, permanently reduce its armor by 1 for the rest of combat. If it's armor is 0, it becomes vulnerable+."
    }
  ],
  "Actions": [
    {
      "Name": "Ancient Geo",
      "ActionCost": 1,
      "Tags": [ "melee attack", "arc 6 + blast 1" ],
      "Hit": "2[D] and foe is dazed.",
      "Miss": "[D].",
      "AreaEffect": "[D].",
      "Effect": "Dazed foes take +[D] from either effect."
    },
    {
      "Name": "Earthforce",
      "ActionCost": 1,
      "Description": "An adjacent foe or piece of terrain is shoved 3. If a piece of terrain is shoved, characters in its path are shoved 1 to either side, then take fray damage and become dazed.",
      "Collide": "Characters take [D]."
    },
    {
      "Name": "Hurl Self",
      "ActionCost": 2,
      "Description": "The Boulder hob reduces its max hp by 25%, hurling part of itself at a foe. A foe in range 5 must save or take 3[D], be shoved 3, and become stunned. On a successful save, they are shoved 1 and take [D]. Then, create a height 1 terrain piece adjacent to that foe. The hob can reduce its hp to 0 and defeat itself with this move."
    }
  ]
}