{
  "Name": "Wissan",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Hob",
  "IsUniqueJob": true,
  "UsesTemplate": "Hob",
  "Chapter": 2,
  "Vitality": 8,
  "HPMultiplier": 8,
  "Speed": 3,
  "Dash": 2,
  "Defense": 6,
  "Armor": 0,
  "FrayDamage": 4,
  "DamageDie": "d8",
  "Traits": [
    {
      "Name": "Greenwalker",
      "Description": "All hobs ignore difficult and dangerous terrain."
    },
    {
      "Name": "Phasing",
      "Description": "Can ignore obstruction and pass through, but not end your turn in, terrain or characters."
    },
    {
      "Name": "Aetherwall",
      "Description": "Cover from ranged attacks further away than range 2."
    },
    {
      "Name": "Overdrive 4",
      "Description": "Attacks are all critical hits on hit at round 4 or later."
    },
    {
      "Name": "Deep Rooted",
      "Description": "At the start of any combat, place 4 deep roots on the map, which are size 1 summons with 25% of the Wissan's max HP and the Aetherwall trait. All roots must be accessible to characters and placed within range 6 of another root."
    },
    {
      "Name": "Tied to the Tree",
      "Description": "The Wissan is intangible until all four roots have been destroyed. When they are destroyed, it is instantly defeated and disappears. It can teleport to any space adjacent to a root as a free action."
    }
  ],
  "Actions": [
    {
      "Name": "Spirit Away",
      "ActionCost": 0,
      "Description": "The Hob swaps places with a character in range 2, teleporting both. If either character cannot teleport, this move cannot be made."
    },
    {
      "Name": "Ancient Bolt",
      "ActionCost": 1,
      "Tags": [ "ranged attack", "line 8" ],
      "Hit": "[D]+[fray].",
      "Miss": "[fray].",
      "Effect": "Foes in the line are electrified. Electrified characters take bonus damage."
    },
    {
      "Name": "Root Lash",
      "ActionCost": 1,
      "Description": "A character in range 4 from a root summon or a deep root must save or be shoved as far as possible towards that root, or 1 space on a successful save."
    },
    {
      "Name": "Dagon",
      "ActionCost": 1,
      "Tags": [ "1/round" ],
      "Description": "The Wissan ends its turn then marks out a line 6 area from its space, which becomes known to all characters. It must take a slow turn next round, but at the start of that turn, a freezing weapon made of water crashes into the first character in the line, making the following attack, which doesn't count against the per turn attack limit: Dagon, attack: On hit, 3[D] and inflict frostbite. Miss: [D]. Effect: Frosbitten characters are winded. Winded characters take +[D]."
    },
    {
      "Name": "Summon Root",
      "ActionCost": 1,
      "Recharge": 4,
      "Description": "The Wissan creates a root, a sturdy size 1 summon in range 5. The area around the root is difficult terrain, and the root emits aura 1 around it. Foes in the aura are winded."
    }
  ]
}