{
  "Name": "Hoarder",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Scavenger",
  "IsUniqueJob": true,
  "UsesTemplate": "Scavenger",
  "Chapter": 1,
  "Vitality": 8,
  "HPMultiplier": 8,
  "Speed": 3,
  "Dash": 1,
  "Defense": 6,
  "Armor": 1,
  "FrayDamage": 4,
  "DamageDie": "d8",
  "Traits": [
    {
      "Name": "Overdrive 4",
      "Description": "Attacks are all critical hits on hit at round 4 or later."
    },
    {
      "Name": "Aetherwall",
      "Description": "Cover from ranged attacks further away than range 2."
    },
    {
      "Name": "Great Junk Armor",
      "Description": "The first and second time the Hoarder is damaged by an attack or ability in a combat, reduce all damage to 0 and summon 2 valuables tokens in spaces in range 2 from them."
    }
  ],
  "Actions": [
    {
      "Name": "Animate Junk Golem",
      "ActionCost": 1,
      "Tags": [ "1/combat", "summon" ],
      "Description": "The Hoarder summons a Junk Golem, a size 1 sturdy summon. \n- When summoned, or on the hoarder's turn, the golem can move 3 spaces, then shove an adjacent foe 2. If that foe collides, they are dazed. \n- The golem gains vigilance 1 at the end of the hoarder's turn and uses the hoarder's damage die for damage. \n- When the golem is defeated, drop 3 valuables in or adjacent to the space it occupied. \n- When the golem passes over a valuables token, it absorbs it, gaining vigor 1. It drops any tokens it picked up when it is defeated."
    },
    {
      "Name": "Junk Storm",
      "ActionCost": 1,
      "Tags": [ "ranged attack 8", "blast 1" ],
      "Hit": "[D]+[fray].",
      "Miss": "[fray].",
      "AreaEffect": "[fray].",
      "Effect": "Deals bonus damage to characters holding at least one valuables token. Then, that character drops one valuables token in an adjacent space."
    },
    {
      "Name": "Pile It Up",
      "ActionCost": 1,
      "Description": "The Hoarder creates a height 1 or 2 terrain piece in range 3. Characters adjacent to it when it is created are shoved 1."
    },
    {
      "Name": "Junk Form",
      "ActionCost": 1,
      "Recharge": 4,
      "Description": "The Hoarder transforms into junk, then teleports either 3 spaces or adjacent to the location of any free valuables token."
    }
  ]
}