{
  "Name": "Wrangler",
  "Inherits": "Elite",
  "Type": "Job",
  "Group": "Lowlander",
  "IsUniqueJob": true,
  "UsesTemplate": "Lowlander",
  "Chapter": 2,
  "Vitality": 10,
  "HPMultiplier": 8,
  "Speed": 4,
  "Dash": 2,
  "Defense": 8,
  "Armor": 1,
  "FrayDamage": 3,
  "DamageDie": "d6",
  "Traits": [
    {
      "Name": "Shelter",
      "Description": "+1 boon on saves."
    },
    {
      "Name": "Sturdy",
      "Description": "Immune to shove, daze, and stun."
    },
    {
      "Name": "Beastmaster",
      "Description": "The Wrangler starts combat with 3 trained beasts, which are size 1 summons (with 20 hp). Place them within range 3 of them. Each beast has a different ability (detailed in the Sic attack)."
    }
  ],
  "Interrupts": [
    {
      "Name": "Fierce Loyalty",
      "Trigger": "The Wrangler or one of its summons adjacent to them is targeted by an ability or attack.",
      "Effect": "The attack or ability is retargeted to either the Wrangler or the summon (Wrangler chooses which)."
    }
  ],
  "Actions": [
    {
      "Name": "Diaga",
      "ActionCost": 1,
      "Description": "An ally in range 4 can save, ending a mark, status, or blight on a successful save. If that ally is bloodied, they also gain vigor 1."
    },
    {
      "Name": "Crack the Whip",
      "ActionCost": 1,
      "Description": "The Wrangler shoves all summons (hostile and allied) in range 3 3 spaces."
    },
    {
      "Name": "Disarm",
      "ActionCost": 1,
      "Recharge": 5,
      "Description": "A foe in range 5 must save or become pacified."
    },
    {
      "Name": "Sic",
      "ActionCost": 1,
      "Description": "The Wrangler activates one of its beast summons, from the following list. If it's bloodied, it can activate all three. It must activate a different summon from the last each turn. \n- Goshawk: Flying, dodge. Can fly 3, then Attack (Piercing melee): Line 4. On hit: [D] +fray. Miss or area effect: Fray. \n- Gorebeast: Sturdy. Attack (melee): On hit: [D]+fray. Miss: Fray. Effect: Shove 2. Collide: [D] and stunned. The beast may dash 2 before making this attack. \n- Spitter: Aetherwall. May move 2, then Attack (ranged 8): On hit: Fray damage 3 times. Miss: Fray damage. Effect: Foe is poisoned and must save or lose all vigor."
    }
  ]
}